---
kind: method
id: M:Autodesk.Revit.DB.Plumbing.PipingSystem.GetVolume
source: html/2d77154e-9741-3cf9-d239-fae91b3735b4.htm
---
# Autodesk.Revit.DB.Plumbing.PipingSystem.GetVolume Method

Gets the volume of this piping system.

## Syntax (C#)
```csharp
public double GetVolume()
```

## Remarks
The publicly exposed method.

## Exceptions
- **Autodesk.Revit.Exceptions.InvalidOperationException** - The volume can not be calculated for this system.